In [1]:
import numpy as np
import pandas as pd

In [2]:
dataDict = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 25], "Izmir": [30, 45, 20]}

In [3]:
weatherDataFrame = pd.DataFrame(dataDict)

In [4]:
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     30
1      29.0     NaN     45
2       NaN    25.0     20

In [5]:
weatherDataFrame.dropna() # nan olanları silecek

   Istanbul  Ankara  Izmir
0      30.0    20.0     30

In [7]:
weatherDataFrame.dropna(axis=1) # kolon olarak nan olanı silecek

   Izmir
0     30
1     45
2     20

In [18]:
newDataDict = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 25], "Izmir": [30, 45, 20], "Konya": [15, np.nan, np.nan], "Adana": [np.nan, 40, 45]}

In [19]:
newWeatherDataFrame = pd.DataFrame(newDataDict)

In [20]:
newWeatherDataFrame

   Istanbul  Ankara  Izmir  Konya  Adana
0      30.0    20.0     30   15.0    NaN
1      29.0     NaN     45    NaN   40.0
2       NaN    25.0     20    NaN   45.0

In [23]:
newWeatherDataFrame.dropna(axis = 1, thresh=2) # Belli bir sınırın üstündeki yerleri silmek için

   Istanbul  Ankara  Izmir  Adana
0      30.0    20.0     30    NaN
1      29.0     NaN     45   40.0
2       NaN    25.0     20   45.0

In [26]:
newWeatherDataFrame.fillna("-") # nan olan yerleri doldurmak istersek fillna kullanabiliriz

  Istanbul Ankara  Izmir Konya Adana
0       30     20     30    15     -
1       29      -     45     -    40
2        -     25     20     -    45

### groupby

In [27]:
salaryDict = {"Departman": ["Yazilim", "Yazilim", "Pazarlama", "Pazarlama", "Hukuk", "Hukuk"],
             "Calisan Adi": ["Ahmet", "Mehmet", "Ali", "Ayse", "Fatma", "Lale"],
              "Maas": [100, 150, 200, 300, 400, 500]
             }

In [29]:
salaryDataFrame = pd.DataFrame(salaryDict)

In [30]:
salaryDataFrame

   Departman Calisan Adi  Maas
0    Yazilim       Ahmet   100
1    Yazilim      Mehmet   150
2  Pazarlama         Ali   200
3  Pazarlama        Ayse   300
4      Hukuk       Fatma   400
5      Hukuk        Lale   500

In [32]:
groupObject = salaryDataFrame.groupby("Departman") # Departman'a göre gruplandırdı

In [33]:
groupObject.count() # sayısını veriyor

           Calisan Adi  Maas
Departman
Hukuk                2     2
Pazarlama            2     2
Yazilim              2     2

In [34]:
groupObject.mean() # ortalamasını veriyor

           Maas
Departman
Hukuk       450
Pazarlama   250
Yazilim     125

In [35]:
groupObject.min()

          Calisan Adi  Maas
Departman
Hukuk           Fatma   400
Pazarlama         Ali   200
Yazilim         Ahmet   100

In [36]:
groupObject.max()

          Calisan Adi  Maas
Departman
Hukuk            Lale   500
Pazarlama        Ayse   300
Yazilim        Mehmet   150

In [37]:
groupObject.describe() # az önce baktığımız özelliklerin hepsini bize veriyor

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazilim     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0